<?php

return [
    0  => [
        'pat' => '/^[\x{4e00}-\x{9fa5}0-9a-zA-Z_]+$/u',
        'msg' => '只允许输入数字、字母、下划线和中文！',
    ],
    1  => [
        'pat' => '/^[0-9a-zA-Z_]+$/',
        'msg' => '只允许输入数字、字母、下划线！',
    ],
    2  => [
        'pat' => '/^[\x{4e00}-\x{9fa5}0-9a-zA-Z_.:]+$/u',
        'msg' => '只允许输入数字、字母、下划线、中文以及[.]与[:]！',
    ],
    3  => [
        'pat' => '/^[0-9a-zA-Z_.]+$/',
        'msg' => '只允许输入数字、字母、下划线和[.]！',
    ],
    //漏洞扫描-端口配置-应用校验
    4  => [
        'pat' => '/^[0-9a-zA-Z_-]+$/',
        'msg' => '只允许输入数字、字母、下划线和[-]！',
    ],
    //文件名
    5  => [
        'pat' => '/^[0-9a-zA-Z_]+[0-9a-zA-Z_.]*$/',
        'msg' => '只允许输入数字、字母、下划线和[.]且[.]不能作为第一个字符！',
    ],
    6  => [
        //'pat' => '/[^\\\'"]+$/',
        'pat' => ["'", '\\', '"'],
        'msg' => '不允许输入特殊字符:单引号、反斜杠、双引号【\' \\ " 】！',
    ],
    7  => [
        'pat' => '/^[\x{4e00}-\x{9fa5}0-9a-zA-Z\s]+$/u',
        'msg' => '只允许输入中文、英文、数字和空格！',
    ],
    10 => [
        'pat' => ['\\', '/', '*', '?', '"', '<', '>', '|',"'",'&',';','`'],
        'msg' => '不允许输入特殊字符！[/,\,*,?,",<,>,|,\',&,;,`]',
    ],
    11 => [
        'pat' => ["\n", '|', '>', '<', '\\', '/', ':', '*', '?', '"', '%', '..'],
        'msg' => '不允许输入特殊字符！[换行,|,>,<,\,/,:,*,?,",%,..]',
    ],
    //规则名称校验
    12 => [
        'pat' => ["'", '<', '>', ' ', '!', '@', '#', '$', '%', '^', '&', '*', '+', '-', '(', ')', '\\', '/', '?', '``'],
        'msg' => '不允许输入特殊字符！[\',<,>,空格,!,@,#,$,%,^,&,*,+,-,(,),\\,/]',
    ],
    //规则描述校验
    13 => [
        'pat' => ["'", '<', '>', '#'],
        'msg' => '不允许输入特殊字符！[\',<,>,#]',
    ],
    //扫描设置 标记主题内容
    14 => [
        'pat' => ["\\", "'", '"', '~', '!', '@', '#', '$', '%', '^', '&', ' '],
        'msg' => '不允许输入特殊字符以及空格！[\\,\',",~,!,@,#,$,%,^,&]',
    ],
    15 => [
        'pat' => ['\\', '*', '?', '"', '<', '>', '|'],
        'msg' => '不允许输入特殊字符！[\,*,?,",<,>,|]',
    ],
    20 => [
        'pat' => '/^eth[0-9]+$/',
        'msg' => '网口错误！',
    ],
    21 => [
        'pat' => '/^[0-9:,]+$/u',
        'msg' => '数据格式错误！',
    ],
    22 => [
        'pat' => '/^[0-9,]+$/u',
        'msg' => '数据格式错误！',
    ],
    //cve-no校验
    23 => [
        'pat' => '/^[0-9-]+$/u',
        'msg' => '数据格式错误！',
    ],
    24 => [
        'pat' => '/^([0-9A-Fa-f]{2})(\s[0-9A-Fa-f]{2})*$/',
        'msg' => '数据格式错误！',
    ],
    //特征字符校验
    25 => [
        'pat' => '/^0x[a-f0-9A-F]{1,2}$/',
        'msg' => '特征字符格式错误！',
    ],
    26 => [
        'pat' => '/^(\\\\x[a-f0-9]{2})+$/',
        'msg' => '特征字符格式错误！',
    ],
    27 => [
        'pat' => '/^[A-Fa-f0-9]{2}(:[A-Fa-f0-9]{2}){5}$/',
        'msg' => 'MAC地址格式错误！',
    ],
    //url校验
    30 => [
        'pat' => '/^([\w-]+\.)+((com)|(net)|(org)|(gov\.cn)|(info)|(cc)|(com\.cn)|(net\.cn)|(org\.cn)|(name)|(biz)|(tv)|(cn)|(mobi)|(name)|(sh)|(ac)|(io)|(tw)|(com\.tw)|(hk)|(com\.hk)|(ws)|(travel)|(us)|(tm)|(la)|(me\.uk)|(org\.uk)|(ltd\.uk)|(plc\.uk)|(in)|(eu)|(it)|(jp))$/',
        'msg' => '域名格式错误！',
    ],
    31 => [
        'pat' => [' '],
        'msg' => '密码不允许输入空格',
    ],
    32 => [
        'pat' => ['!', '$', '*', '(', ')', '|', '<', '>', '\\', ',', "'", '"', '{', '}', '+', '=', '`', '~'],
        'msg' => '对不起，请不要输入非法字符！',
    ],
    33 => [
        'pat' => '/^[0-9]\d*$/',
        'msg' => '只允许输入数字！',
    ],
    34  => [
        'pat' => '/^[\x{4e00}-\x{9fa5}0-9a-zA-Z]+$/u',
        'msg' => '只允许输入数字、字母和中文！',
    ],
    35  => [
        'pat' => ["'"],
        'msg' => '不允许输入特殊字符单引号【\'】！',
    ],
    36  => [
        'pat' => ["'",'"'],
        'msg' => '不允许输入特殊字符单引号、双引号【\'、"】！',
    ],
    37  => [
        'pat' => ["'", '\\', '"',' '],
        'msg' => '不允许输入特殊字符:单引号、反斜杠、双引号及空格【\' \\ " 】！',
    ],
    38  => [
        'pat' => ["'",'"',' '],
        'msg' => '不允许输入特殊字符单引号、双引号及空格【\'、"】！',
    ],
    40  => [
        'pat' => '/^[a-z0-9]+([._-][a-z0-9]+)*@([0-9a-z]+\.[a-z]{2,14}(\.[a-z]{2})?)$/i',
        'msg' => '邮箱输入不合法!',
    ],
    41  => [
        'pat' => '/^1[34578]\d{9}$/',
        'msg' => '手机号输入不合法!',
    ],
    42  => [
        'pat' => '/^[a-zA-Z]\w{3,9}$/',
        'msg' => '密码长度4-10位，且以字母开头数字下划线组成！',
    ],
    43  => [
    'pat' => '/^(http|https|ftp):\/\/[A-Za-z0-9]+\.[A-Za-z0-9]+[\/=\?%\-&_~`@[\]\’:+!]*([^<>\”])*$/',
    'msg' => 'URL不合法!',
],

];
